#  Creating SQLite Database

In [1]:
# Import necessary module
from sqlalchemy import create_engine

# Create engine: engine
engine=create_engine('sqlite:///Chinook.sqlite')

# Perform query: rs

con = engine.raw_connection()
con.execute("""CREATE TABLE Student (
            first text,
            last text,
            pay integer
            )""")
#con.commit()
# Save the table names to a list: table_names
table_names=engine.table_names()

# Print the table names to the shell
print(table_names)
con.close()

['Student', 'employees', 'teachers']

# INSERTING Value in DATABASE Table

In [2]:
engine=create_engine('sqlite:///Chinook.sqlite')

con=engine.connect()

# Perform query: 
con.execute("""INSERT INTO employees (first,last,pay) VALUES ('amit','gupta', 20000.00 );""")
con.close()

In [4]:
import pandas as pd

# Open engine connection: con
# Create engine: engine
engine=create_engine('sqlite:///Chinook.sqlite')

con=engine.connect()

# Perform query: rs
rs = con.execute("""SELECT * FROM employees""")
print(rs.fetchall())
# Save results of the query to DataFrame: df
df = pd.read_sql_query("SELECT * FROM employees", con)

# Close connection
con.close()

# Print head of DataFrame df
display(df.head())

[('amit', 'sharma', 20000), ('amit', 'sharma', 20000), ('amit', 'gupta', 20000), ('amit', 'gupta', 20000)]

  first    last    pay
0  amit  sharma  20000
1  amit  sharma  20000
2  amit   gupta  20000
3  amit   gupta  20000